#### 📖 Terraform Plan ('src/common/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
"microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-funcsvc-asp-01"
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 25
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT10M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
        }
    }

  # module.function_app_services.azurerm_storage_queue.message-created will be created
  + resource "azurerm_storage_queue" "message-created" {
      + id                   = (known after apply)
      + name                 = "message-created"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfuncsvcst01"
    }

  # module.function_app_services.azurerm_storage_queue.message-created-poison will be created
  + resource "azurerm_storage_queue" "message-created-poison" {
      + id                   = (known after apply)
      + name                 = "message-created-poison"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfuncsvcst01"
    }

  # module.function_app_services.azurerm_storage_queue.message-processed will be created
  + resource "azurerm_storage_queue" "message-processed" {
      + id                   = (known after apply)
      + name                 = "message-processed"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfuncsvcst01"
    }

  # module.function_app_services.azurerm_storage_queue.message-processed-poison will be created
  + resource "azurerm_storage_queue" "message-processed-poison" {
      + id                   = (known after apply)
      + name                 = "message-processed-poison"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfuncsvcst01"
    }

  # module.function_app_services.azurerm_storage_queue.notification-created-email will be created
  + resource "azurerm_storage_queue" "notification-created-email" {
      + id                   = (known after apply)
      + name                 = "notification-created-email"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfuncsvcst01"
    }

  # module.function_app_services.azurerm_storage_queue.notification-created-email-poison will be created
  + resource "azurerm_storage_queue" "notification-created-email-poison" {
      + id                   = (known after apply)
      + name                 = "notification-created-email-poison"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfuncsvcst01"
    }

  # module.function_app_services.azurerm_storage_queue.notification-created-webhook-poison will be created
  + resource "azurerm_storage_queue" "notification-created-webhook-poison" {
      + id                   = (known after apply)
      + name                 = "notification-created-webhook-poison"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfuncsvcst01"
    }

  # module.function_app_services.module.function_services_dx.azurerm_linux_function_app.this will be created
  + resource "azurerm_linux_function_app" "this" {
      + app_settings                                   = {
          + "APIM_BASE_URL"                                   = "https://api-app.internal.io.pagopa.it"
          + "APIM_SUBSCRIPTION_KEY"                           = (sensitive value)
          + "AzureWebJobs.CreateNotification.Disabled"        = "0"
          + "AzureWebJobs.EmailNotification.Disabled"         = "0"
          + "AzureWebJobs.OnFailedProcessMessage.Disabled"    = "0"
          + "AzureWebJobs.ProcessMessage.Disabled"            = "0"
          + "AzureWebJobs.WebhookNotification.Disabled"       = "0"
          + "BETA_USERS"                                      = (sensitive value)
          + "COSMOSDB_KEY"                                    = (sensitive value)
          + "COSMOSDB_NAME"                                   = "db"
          + "COSMOSDB_URI"                                    = "https://io-p-cosmos-api.documents.azure.com:443/"
          + "DEFAULT_SUBSCRIPTION_PRODUCT_NAME"               = "io-services-api"
          + "EMAIL_NOTIFICATION_SERVICE_BLACKLIST"            = (sensitive value)
          + "FEATURE_FLAG"                                    = "CANARY"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "FF_DISABLE_WEBHOOK_MESSAGE_CONTENT"              = "false"
          + "FF_OPT_IN_EMAIL_ENABLED"                         = "true"
          + "FF_PAYMENT_STATUS_ENABLED"                       = "true"
          + "FF_TEMPLATE_EMAIL"                               = "ALL"
          + "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "2"
          + "INTERNAL_STORAGE_CONNECTION_STRING"              = (sensitive value)
          + "IO_FUNCTIONS_ADMIN_API_TOKEN"                    = (sensitive value)
          + "IO_FUNCTIONS_ADMIN_BASE_URL"                     = "https://api-app.internal.io.pagopa.it"
          + "MAILUP_SECRET"                                   = (sensitive value)
          + "MAILUP_USERNAME"                                 = (sensitive value)
          + "MAIL_FROM"                                       = "IO - l'app dei servizi pubblici <no-reply@io.italia.it>"
          + "MAIL_FROM_DEFAULT"                               = "IO - l'app dei servizi pubblici <no-reply@io.italia.it>"
          + "MESSAGE_CONTAINER_NAME"                          = "message-content"
          + "MESSAGE_CONTENT_STORAGE_CONNECTION_STRING"       = (sensitive value)
          + "MESSAGE_CREATED_QUEUE_NAME"                      = "message-created"
          + "MESSAGE_PROCESSED_QUEUE_NAME"                    = "message-processed"
          + "MIN_APP_VERSION_WITH_READ_AUTH"                  = "2.14.0"
          + "NODE_ENV"                                        = "production"
          + "NOTIFICATION_CREATED_EMAIL_QUEUE_NAME"           = "notification-created-email"
          + "NOTIFICATION_CREATED_WEBHOOK_QUEUE_NAME"         = "notification-created-webhook"
          + "OPT_OUT_EMAIL_SWITCH_DATE"                       = "1625781600"
          + "PAGOPA_ECOMMERCE_API_KEY"                        = (sensitive value)
          + "PAGOPA_ECOMMERCE_BASE_URL"                       = "https://api.platform.pagopa.it/ecommerce/payment-requests-service/v1"
          + "PN_SERVICE_ID"                                   = "01G40DWQGKY5GRWSNM4303VNRP"
          + "PROCESSING_MESSAGE_CONTAINER_NAME"               = "processing-messages"
          + "SANDBOX_FISCAL_CODE"                             = (sensitive value)
          + "SENDING_FUNC_API_KEY"                            = (sensitive value)
          + "SENDING_FUNC_API_URL"                            = "https://io-p-itn-com-rc-func-01.azurewebsites.net"
          + "SLOT_TASK_HUBNAME"                               = "ProductionTaskHub"
          + "SUBSCRIPTIONS_FEED_TABLE"                        = "SubscriptionsFeedByDay"
          + "SUBSCRIPTION_FEED_STORAGE_CONNECTION_STRING"     = (sensitive value)
          + "TTL_FOR_USER_NOT_FOUND"                          = "94608000"
          + "WEBHOOK_CHANNEL_URL"                             = (sensitive value)
          + "WEBHOOK_NOTIFICATION_SERVICE_BLACKLIST"          = (sensitive value)
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                   = "/api/info"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"               = "200,204"
          + "WEBSITE_WARMUP_PATH"                             = "/api/info"
        }
      + builtin_logging_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "italynorth"
      + name                                           = "io-p-itn-funcsvc-func-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "io-p-itn-funcsvc-rg-01"
      + service_plan_id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-funcsvc-asp-01"
      + site_credential                                = (sensitive value)
      + storage_account_name                           = "iopitnfuncsvcstfn01"
      + storage_uses_managed_identity                  = true
      + tags                                           = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = (known after apply)
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "20"
              + use_dotnet_isolated_runtime = false
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "SLOT_TASK_HUBNAME",
              + "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
              + "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              + "AzureWebJobs.CreateNotification.Disabled",
              + "AzureWebJobs.EmailNotification.Disabled",
              + "AzureWebJobs.OnFailedProcessMessage.Disabled",
              + "AzureWebJobs.ProcessMessage.Disabled",
              + "AzureWebJobs.WebhookNotification.Disabled",
            ]
        }
    }

  # module.function_app_services.module.function_services_dx.azurerm_linux_function_app_slot.this[0] will be created
  + resource "azurerm_linux_function_app_slot" "this" {
      + app_settings                                   = {
          + "APIM_BASE_URL"                                   = "https://api-app.internal.io.pagopa.it"
          + "APIM_SUBSCRIPTION_KEY"                           = (sensitive value)
          + "AzureWebJobs.CreateNotification.Disabled"        = "1"
          + "AzureWebJobs.EmailNotification.Disabled"         = "1"
          + "AzureWebJobs.OnFailedProcessMessage.Disabled"    = "1"
          + "AzureWebJobs.ProcessMessage.Disabled"            = "1"
          + "AzureWebJobs.WebhookNotification.Disabled"       = "1"
          + "BETA_USERS"                                      = (sensitive value)
          + "COSMOSDB_KEY"                                    = (sensitive value)
          + "COSMOSDB_NAME"                                   = "db"
          + "COSMOSDB_URI"                                    = "https://io-p-cosmos-api.documents.azure.com:443/"
          + "DEFAULT_SUBSCRIPTION_PRODUCT_NAME"               = "io-services-api"
          + "EMAIL_NOTIFICATION_SERVICE_BLACKLIST"            = (sensitive value)
          + "FEATURE_FLAG"                                    = "CANARY"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "FF_DISABLE_WEBHOOK_MESSAGE_CONTENT"              = "false"
          + "FF_OPT_IN_EMAIL_ENABLED"                         = "true"
          + "FF_PAYMENT_STATUS_ENABLED"                       = "true"
          + "FF_TEMPLATE_EMAIL"                               = "ALL"
          + "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "2"
          + "INTERNAL_STORAGE_CONNECTION_STRING"              = (sensitive value)
          + "IO_FUNCTIONS_ADMIN_API_TOKEN"                    = (sensitive value)
          + "IO_FUNCTIONS_ADMIN_BASE_URL"                     = "https://api-app.internal.io.pagopa.it"
          + "MAILUP_SECRET"                                   = (sensitive value)
          + "MAILUP_USERNAME"                                 = (sensitive value)
          + "MAIL_FROM"                                       = "IO - l'app dei servizi pubblici <no-reply@io.italia.it>"
          + "MAIL_FROM_DEFAULT"                               = "IO - l'app dei servizi pubblici <no-reply@io.italia.it>"
          + "MESSAGE_CONTAINER_NAME"                          = "message-content"
          + "MESSAGE_CONTENT_STORAGE_CONNECTION_STRING"       = (sensitive value)
          + "MESSAGE_CREATED_QUEUE_NAME"                      = "message-created"
          + "MESSAGE_PROCESSED_QUEUE_NAME"                    = "message-processed"
          + "MIN_APP_VERSION_WITH_READ_AUTH"                  = "2.14.0"
          + "NODE_ENV"                                        = "production"
          + "NOTIFICATION_CREATED_EMAIL_QUEUE_NAME"           = "notification-created-email"
          + "NOTIFICATION_CREATED_WEBHOOK_QUEUE_NAME"         = "notification-created-webhook"
          + "OPT_OUT_EMAIL_SWITCH_DATE"                       = "1625781600"
          + "PAGOPA_ECOMMERCE_API_KEY"                        = (sensitive value)
          + "PAGOPA_ECOMMERCE_BASE_URL"                       = "https://api.platform.pagopa.it/ecommerce/payment-requests-service/v1"
          + "PN_SERVICE_ID"                                   = "01G40DWQGKY5GRWSNM4303VNRP"
          + "PROCESSING_MESSAGE_CONTAINER_NAME"               = "processing-messages"
          + "SANDBOX_FISCAL_CODE"                             = (sensitive value)
          + "SENDING_FUNC_API_KEY"                            = (sensitive value)
          + "SENDING_FUNC_API_URL"                            = "https://io-p-itn-com-rc-func-01.azurewebsites.net"
          + "SLOT_TASK_HUBNAME"                               = "StagingTaskHub"
          + "SUBSCRIPTIONS_FEED_TABLE"                        = "SubscriptionsFeedByDay"
          + "SUBSCRIPTION_FEED_STORAGE_CONNECTION_STRING"     = (sensitive value)
          + "TTL_FOR_USER_NOT_FOUND"                          = "94608000"
          + "WEBHOOK_CHANNEL_URL"                             = (sensitive value)
          + "WEBHOOK_NOTIFICATION_SERVICE_BLACKLIST"          = (sensitive value)
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                   = "/api/info"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"               = "200,204"
          + "WEBSITE_WARMUP_PATH"                             = "/api/info"
        }
      + builtin_logging_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + function_app_id                                = (known after apply)
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + site_credential                                = (sensitive value)
      + storage_account_name                           = "iopitnfuncsvcstfn01"
      + storage_uses_managed_identity                  = true
      + tags                                           = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = (known after apply)
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "20"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # module.function_app_services.module.function_services_dx.azurerm_monitor_metric_alert.function_app_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      + auto_mitigate            = false
      + description              = "Function availability is under threshold level. Runbook: -"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-funcsvc-func-01] Health Check Failed"
      + resource_group_name      = "io-p-itn-funcsvc-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 1
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "HealthCheckStatus"
          + metric_namespace       = "Microsoft.Web/sites"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 50
        }
    }

  # module.function_app_services.module.function_services_dx.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitnfuncsvcstfn01] Low Availability"
        name                     = "[iopitnfuncsvcstfn01] Low Availability"
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "2.0.1"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app_services.module.function_services_dx.azurerm_private_endpoint.function_sites will be created
  + resource "azurerm_private_endpoint" "function_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-funcsvc-func-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-funcsvc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-funcsvc-func-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.function_app_services.module.function_services_dx.azurerm_private_endpoint.staging_function_sites[0] will be created
  + resource "azurerm_private_endpoint" "staging_function_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-funcsvc-staging-func-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-funcsvc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-funcsvc-staging-func-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-staging",
            ]
        }
    }

  # module.function_app_services.module.function_services_dx.azurerm_role_assignment.function_storage_account_contributor will be created
  + resource "azurerm_role_assignment" "function_storage_account_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfuncsvcstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_app_services.module.function_services_dx.azurerm_role_assignment.function_storage_blob_data_owner will be created
  + resource "azurerm_role_assignment" "function_storage_blob_data_owner" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfuncsvcstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_app_services.module.function_services_dx.azurerm_role_assignment.function_storage_queue_data_contributor will be created
  + resource "azurerm_role_assignment" "function_storage_queue_data_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfuncsvcstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_app_services.module.function_services_dx.azurerm_role_assignment.staging_function_storage_account_contributor[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_account_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfuncsvcstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_app_services.module.function_services_dx.azurerm_role_assignment.staging_function_storage_blob_data_owner[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_blob_data_owner" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfuncsvcstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_app_services.module.function_services_dx.azurerm_role_assignment.staging_function_storage_queue_data_contributor[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_queue_data_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfuncsvcstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_app_services.module.function_services_dx.azurerm_storage_account_network_rules.st_network_rules will be created
  + resource "azurerm_storage_account_network_rules" "st_network_rules" {
      + bypass             = [
          + "AzureServices",
          + "Logging",
          + "Metrics",
        ]
      + default_action     = "Deny"
      + id                 = (known after apply)
      + storage_account_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfuncsvcstfn01"
    }

  # module.function_app_services.module.function_services_dx.azurerm_subnet.this[0] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.20.34.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-itn-funcsvc-func-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-common-rg-01"
      + virtual_network_name                          = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.function_app_services.module.services_storage_account.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitnfuncsvcst01] Low Availability"
        name                     = "[iopitnfuncsvcst01] Low Availability"
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.0.0"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
        name                          = "io-p-itn-platform-api-gateway-apim-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.2.2"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

      ~ hostname_configuration {
          ~ proxy {
              ~ default_ssl_binding             = true -> false
                # (12 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.data.azurerm_private_dns_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-evt-rg"
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.azurerm_private_endpoint.service_bus_pep[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "service_bus_pep" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01"
        name                          = "io-p-itn-platform-sbns-pep-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_service_bus_namespace"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.0.4"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ] -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_admins[0].module.storage_account.azurerm_role_assignment.blob["iopstexportdata|*|writer"] will be destroyed
  # (because key ["iopstexportdata|*|writer"] is not in for_each map)
  - resource "azurerm_role_assignment" "blob" {
      - description                            = "Allow IO Comunicazione Admins to manage blob files" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata/providers/Microsoft.Authorization/roleAssignments/70560df9-8d2e-a699-6ed4-bfee93664fa4" -> null
      - name                                   = "70560df9-8d2e-a699-6ed4-bfee93664fa4" -> null
      - principal_id                           = "12a48460-7d95-4d91-ab0a-1d19008aac2c" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> null
      - role_definition_name                   = "Storage Blob Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata" -> null
        # (3 unchanged attributes hidden)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_admins[0].module.storage_account.azurerm_role_assignment.blob["iopstexportdata|*|writer|Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Allow IO Comunicazione Admins to manage blob files"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12a48460-7d95-4d91-ab0a-1d19008aac2c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_admins[0].module.storage_account.azurerm_role_assignment.table["iopstexportdata|*|writer"] will be destroyed
  # (because key ["iopstexportdata|*|writer"] is not in for_each map)
  - resource "azurerm_role_assignment" "table" {
      - description                            = "Allow IO Comunicazione Admins to manage tables" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata/providers/Microsoft.Authorization/roleAssignments/fca594de-f1f8-31ea-287b-0864d4363703" -> null
      - name                                   = "fca594de-f1f8-31ea-287b-0864d4363703" -> null
      - principal_id                           = "12a48460-7d95-4d91-ab0a-1d19008aac2c" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/0a9a7e1f-b9d0-4cc4-a60d-0319b160aaa3" -> null
      - role_definition_name                   = "Storage Table Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata" -> null
        # (3 unchanged attributes hidden)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_admins[0].module.storage_account.azurerm_role_assignment.table["iopstexportdata|*|writer|Storage Table Data Contributor"] will be created
  + resource "azurerm_role_assignment" "table" {
      + condition_version                = (known after apply)
      + description                      = "Allow IO Comunicazione Admins to manage tables"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12a48460-7d95-4d91-ab0a-1d19008aac2c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_devs[0].module.storage_account.azurerm_role_assignment.blob["iopstexportdata|*|writer"] will be destroyed
  # (because key ["iopstexportdata|*|writer"] is not in for_each map)
  - resource "azurerm_role_assignment" "blob" {
      - description                            = "Allow IO Comunicazione Devs to manage blob files" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata/providers/Microsoft.Authorization/roleAssignments/be23521b-80e3-ab4e-9e92-bb702291ed3c" -> null
      - name                                   = "be23521b-80e3-ab4e-9e92-bb702291ed3c" -> null
      - principal_id                           = "7b78851b-c40d-497d-ae7f-596b8f92ecf2" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> null
      - role_definition_name                   = "Storage Blob Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata" -> null
        # (3 unchanged attributes hidden)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_devs[0].module.storage_account.azurerm_role_assignment.blob["iopstexportdata|*|writer|Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Allow IO Comunicazione Devs to manage blob files"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7b78851b-c40d-497d-ae7f-596b8f92ecf2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_devs[0].module.storage_account.azurerm_role_assignment.table["iopstexportdata|*|writer"] will be destroyed
  # (because key ["iopstexportdata|*|writer"] is not in for_each map)
  - resource "azurerm_role_assignment" "table" {
      - description                            = "Allow IO Comunicazione Devs to manage tables" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata/providers/Microsoft.Authorization/roleAssignments/152468ab-ec74-9802-70a9-45000d2be43b" -> null
      - name                                   = "152468ab-ec74-9802-70a9-45000d2be43b" -> null
      - principal_id                           = "7b78851b-c40d-497d-ae7f-596b8f92ecf2" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/0a9a7e1f-b9d0-4cc4-a60d-0319b160aaa3" -> null
      - role_definition_name                   = "Storage Table Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata" -> null
        # (3 unchanged attributes hidden)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_devs[0].module.storage_account.azurerm_role_assignment.table["iopstexportdata|*|writer|Storage Table Data Contributor"] will be created
  + resource "azurerm_role_assignment" "table" {
      + condition_version                = (known after apply)
      + description                      = "Allow IO Comunicazione Devs to manage tables"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7b78851b-c40d-497d-ae7f-596b8f92ecf2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts_itn.module.retirements_itn_01_admins[0].module.storage_account.azurerm_role_assignment.blob["iopitnretirementsst01|*|owner"] will be destroyed
  # (because key ["iopitnretirementsst01|*|owner"] is not in for_each map)
  - resource "azurerm_role_assignment" "blob" {
      - description                            = "Allow IO Admins to manage blob files" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnretirementsst01/providers/Microsoft.Authorization/roleAssignments/7f994aa2-3d66-5f45-0921-86f920335d2b" -> null
      - name                                   = "7f994aa2-3d66-5f45-0921-86f920335d2b" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnretirementsst01" -> null
        # (3 unchanged attributes hidden)
    }

  # module.storage_accounts_itn.module.retirements_itn_01_admins[0].module.storage_account.azurerm_role_assignment.blob["iopitnretirementsst01|*|owner|Storage Blob Data Owner"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Allow IO Admins to manage blob files"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnretirementsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts_itn.module.retirements_itn_01_admins[0].module.storage_account.azurerm_role_assignment.table["iopitnretirementsst01|*|owner"] will be destroyed
  # (because key ["iopitnretirementsst01|*|owner"] is not in for_each map)
  - resource "azurerm_role_assignment" "table" {
      - description                            = "Allow IO Admins to manage tables" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnretirementsst01/providers/Microsoft.Authorization/roleAssignments/8cac3bab-b89e-e5e5-9693-16a938b77638" -> null
      - name                                   = "8cac3bab-b89e-e5e5-9693-16a938b77638" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/0a9a7e1f-b9d0-4cc4-a60d-0319b160aaa3" -> null
      - role_definition_name                   = "Storage Table Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnretirementsst01" -> null
        # (3 unchanged attributes hidden)
    }

  # module.storage_accounts_itn.module.retirements_itn_01_admins[0].module.storage_account.azurerm_role_assignment.table["iopitnretirementsst01|*|owner|Storage Table Data Contributor"] will be created
  + resource "azurerm_role_assignment" "table" {
      + condition_version                = (known after apply)
      + description                      = "Allow IO Admins to manage tables"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnretirementsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 27 to add, 7 to change, 6 to destroy.

Warning: Argument is deprecated

  with module.apim_itn.module.apim.azurerm_api_management.this,
  on .terraform/modules/apim_itn.apim/main.tf line 18, in resource "azurerm_api_management" "this":
  18: resource "azurerm_api_management" "this" {

`key_vault_id` has been deprecated in favour of `key_vault_certificate_id`
and will be removed in v5.0 of the AzureRM provider

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
